---
kind: type
id: T:Autodesk.Revit.Exceptions.RevitServerCommunicationException
source: html/a0003d89-0113-6623-65da-0db5c568bfb6.htm
---
# Autodesk.Revit.Exceptions.RevitServerCommunicationException

The exception that is thrown when there is any network communication error happening.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class RevitServerCommunicationException : RevitServerException
```